package homework4;



public class Task4 {
	/*
	 * Имате предварително въведени стойности на елементи в двумерен масив -
	 * естествени числа. Да се състави програма, чрез която се извеждат
	 * стойностите на елементите в двумерен масив след обръщането му на +90
	 * градуса. Пример: 1,2,3,4 5,6,7,8 9,10,11,12 13,14,15,16 Изход 13,9,5,1
	 * 14,10,6,2 15,11,7,3 16,12,8,4
	 */

	public static void main(String[] args) {
		int[][] arr = { { 1, 2, 3, 4 }, { 5, 6, 7, 8 }, { 9, 10, 11, 12 }, { 13, 14, 15, 16 } };

		for (int row = 0; row < arr.length; row++) {

			for (int col = arr.length - 1; col >= 0; col--) {
				System.out.print(arr[col][row] + ",");
			}
			System.out.println();
		}

	}

}
